#Задача №1 (Раздел: Объявление переменных и типы данных)

#Создайте три переменные:

#my_name — присвойте ей строковое значение, содержащее ваше имя.
#my_age — присвойте ей целочисленное значение, соответствующее вашему возрасту.
#i_am_new — присвойте ей булево значение, которое будет указывать, что вы новичок в программировании (используйте True или False).
#В конце программы выведите на экран (через print()) тип данных каждой из этих переменных, используя функцию type().

my_name = "Kirill"
my_age = 31
i_am_new = True

print(type(my_name))
print(type(my_age))
print(type(i_am_new))